<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of ClamXav.</string>
    <key>Identifier</key>
    <string>com.github.paul-suh-recipes.download.ClamXav</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ClamXav</string>
        <key>BRANCH</key>
        <string>release</string>
    </dict>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://www.clamxav.com/download.php</string>
				<key>re_pattern</key>
				<string>(?P&lt;url&gt;http\://www.clamxav.com/downloads/ClamXav\_[0-9\.]*dmg)</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
