<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Screenflow.</string>
    <key>Identifier</key>
    <string>com.github.paul-suh-recipes.download.Screenflow</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Screenflow</string>
        <key>BRANCH</key>
        <string>release</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
        	<key>Processor</key>
        	<string>URLTextSearcher</string>
        	<key>Arguments</key>
        	<dict>
        		<key>re_pattern</key>
        		<string>appversinfo.{2}([0-9.]+)</string>
        		<key>url</key>
        		<string>http://www.macupdate.com/app/mac/26915/screenflow</string>
        		<key>result_output_var_name</key>
        		<string>version_string</string>
        	</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
            	<key>url</key>
            	<string>http://www.telestream.net/download-files/screenflow/4-5/ScreenFlow-%version_string%.dmg</string>
            	<key>request_headers</key>
            	<dict>
            		<key>User-Agent</key>
            		<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9) AppleWebKit/537.71 (KHTML, like Gecko) Version/7.0 Safari/537.71</string>
            	</dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>



