<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of RoyalTSX.</string>
    <key>Identifier</key>
    <string>com.github.paul-suh-recipes.download.RoyalTSX</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>RoyalTSX</string>
        <key>BRANCH</key>
        <string>release</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MacUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>macupdate_url</key>
                <string>https://www.macupdate.com/app/mac/45084/royal-tsx</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
