<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>uploads RoyalTSX package.</string>
    <key>Identifier</key>
    <string>com.github.paul-suh-recipes.upload.RoyalTSX</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>RoyalTSX</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.paul-suh-recipes.pkg.RoyalTSX</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>ScpUploader</string>
            <key>Arguments</key>
            <dict>
                <key>dest_server</key>
                <string>transpak.mspex.net</string>
                <key>dest_path</key>
                <string>/var/local/www/transpak.mspex.net/htdocs</string>
                <key>dest_username</key>
                <string>locadmin</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>